export const zodiacTypes = ['♑️', '♒️', '♓️', '♈️', '♉️', '♊️', '♋️', '♌️', '♍️', '♎️', '♏️', '♐️']
export const persTypes = [
    'INTJ', 'INTP', 'ENTJ', 'ENTP',
    'INFJ', 'INFP', 'ENFJ', 'ENFP',
    'ISTJ', 'ISFJ', 'ESTJ', 'ESFJ',
    'ISTP', 'ISFP', 'ESTP', 'ESFP'
  ]
export const searchTypes = ['Просто повеселиться 🎉', 'Найти друзей 👋','Все еще разбираюсь 🤔','Долгосрочный партнер 💘',
                        'Долго- или краткосрочно 😍', 'Долго- или краткосрочно 🥂']

                        export const educationTypes = ['Бакалавр', 'Колледж', 'Средняя школа', 'Доктор Наук', 'Аспирантура', 'Магистратура']

export const familyPlansTypes = ['Я хочу детей', 'Я не хочу детей', 'У меня есть дети и хочу еще', 
    'У меня есть дети, но не хочу больше', 'Пока не знаю']

    export const loveLangTypes = ["Жесты внимания", "Подарки", "Прикосновения", 'Комплименты',"Время вместе"]

export const alcoTypes = ['Это не для меня' , 'Я не пью', 'Я за тревость', 'По особым случаям' ,
    'В компании по выходным', 'Почти каждый вечер']

    export const smokeTypes = ['Не курю', 'Курю', 'Курю за компанию', 'Курю, когды выпиваю', 'Бросаю']

export const gymTypes = ['Каждый день','Часто','Иногда','Никогда']

export const foodTypes = ['Веганство','Вегатарианство','Пескетарианство','Кошерная еда','Халяль','Люблю мясо','Ем всё']

export const socMediaTypes = ['Инфлюенсер','Активный пользователь','Меня там нет','Просто смотрю']

export const commTypes = ['Много переписываюсь',"Общаюсь по телефону", 'Люблю видеочаты','Не люблю чатиться','Лучше встречусь лично']

export const nightLiveTypes = ['Жаворонок','Сова','Что-то среднее']

export const sexTypes= ['👚', '👕']

export const booleanTypes:Record<string, string> = {true: 'Да',false: 'Нет'}
